@echo off

:main
cls
@echo SPARC SSH_UPDATER v2.2 
@echo Для выбора пункта меню нажмите соотвествующие цифры на клавиатуре 
@echo и нажмите клавишу ВВОД (ENTER)
@echo --------------------------------------------------------
@echo 1 - Обновить процессор  (Обновление ПО без перезаписи)
@echo 2 - Обновить панель43 (Обновление ПО без перезаписи)
@echo --------------------------------------------------------
@echo 3 - Загрузить базу из процессора
@echo 4 - Перезаписать ПО процессора
@echo 5 - Перезаписать ПО панели43
@echo --------------------------------------------------------
@echo 6 - Тест связи с панелью43
@echo 7 - Тест связи с процессором
@echo 8 - Тест связи с WAGO
@echo --------------------------------------------------------
@echo 9 - Комплексный тест коммуникаций
@echo 10 - Внутренний тест pcproc
@echo 11 - Внутренний тест panel43
@echo --------------------------------------------------------
@echo 12 - Установить Дату и Время Формат: 2016-10-26 17:22
@echo 13 - Обнулить базы
@echo 14 - Патч на проц
@echo 15 - Патч на панель43
@echo 16 - Исправление для проц вер1.0
@echo --------------------------------------------------------
@echo 17 - Резервная копия проц 
@echo 18 - Резервная копия панель43 
@echo 19 - Восстановить из Резервной копии проц 
@echo 20 - Восстановить из Резервной копии панель43 
@echo --------------------------------------------------------
@echo 21 - Прошить в проц версию с конвеером ПЧН
@echo --------------------------------------------------------
@echo --------------------------------------------------------
@echo 22 - Режим отладки PCproc
@echo 23 - Режим отладки Panel43
@echo --------------------------------------------------------
@echo 0 - выход
@echo --------------------------------------------------------
set /p sym=Вариант:
if "%sym%" == "1" (update_pcproc.bat)
if "%sym%" == "2" (update_panel43.bat)
if "%sym%" == "3" (get_db.bat)
if "%sym%" == "4" (rw_pcproc.bat)
if "%sym%" == "5" (rw_panel43.bat)
if "%sym%" == "6" (ping 192.168.1.122)
if "%sym%" == "7" (ping 192.168.1.121)
if "%sym%" == "8" (ping 192.168.1.111)
if "%sym%" == "9" (systest.exe)
if "%sym%" == "10" (get_testproc.bat)
if "%sym%" == "11" (get_testpanel43.bat)
if "%sym%" == "12" (
					set /p nowdate=Дата и Время: 
					dateset.bat %nowdate%					
					
					
					)  
if "%sym%" == "13" (rm_db.bat)
if "%sym%" == "14" (proc_patch.bat)
if "%sym%" == "15" (panel43_patch.bat)
if "%sym%" == "16" (rw_pcproc_v1.bat)
if "%sym%" == "17" (backup_pcproc.bat)
if "%sym%" == "18" (backup_panel43.bat)
if "%sym%" == "19" (rest_backup_pcproc.bat)
if "%sym%" == "20" (rest_backup_panel43.bat)
if "%sym%" == "21" (rw_pcproc_v1_pchn.bat)
if "%sym%" == "22" (pcproc_dbg.bat)
if "%sym%" == "23" (panel43_dbg.bat)
if "%sym%" == "0" (goto exit)
goto main

:exit
exit